Revit 2027 API
ZoneEquipmentData.VRFLoopId Property
 The Varible Refrigerant Flow loop for the VRF fan coil equipment type.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId VRFLoopId { get; set; }
Public Property VRFLoopId As ElementId
	Get
	Set
public:
property ElementId^ VRFLoopId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member VRFLoopId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace